Revit 2027 API
NumberingSchema.RemovePartitioningParameter Method
 Remove a parameter that is used for partitioning elements in this schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemovePartitioningParameter(
	NumberingParameter partitioningParameter
)
Public Sub RemovePartitioningParameter (
	partitioningParameter As NumberingParameter
)
public:
void RemovePartitioningParameter(
	NumberingParameter^ partitioningParameter
)
member RemovePartitioningParameter :
        partitioningParameter : NumberingParameter -> unit
Parameters
partitioningParameter NumberingParameter
 Parameter to remove from partitioning criteria in this schema.
Exceptions
Exception | Condition
ArgumentException |  The input parameter is not valid for use in partitioning for numbering. -or- The schema does not have partitioning parameters
ArgumentNullException |  A non-optional argument was null
Remarks
 This method makes sure that the document will be consistent when it comes to numbering before it exits.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace